
CNN MODEL 5
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 94, 94, 8)         224       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 92, 92, 16)        1168      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 46, 46, 16)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 46, 46, 16)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 33856)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               17334784  
_________________________________________________________________
batch_normalization_1 (Batch (None, 512)               2048      
_________________________________________________________________
dropout_2 (Dropout)          (None, 512)               0         
_________________________________________________________________
activation_1 (Activation)    (None, 512)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 3)                 1539      
=================================================================
Total params: 17,339,763
Trainable params: 17,338,739
Non-trainable params: 1,024
_________________________________________________________________

=================================================================
====================== CONFUSION MATRIX =========================

|                     |   Actual    |  Actual   |   Actual    |
|                     |  Caucasoid  |  Negroid  |  Mongoloid  |
|---------------------+-------------+-----------+-------------|
| Predicted Caucasoid |     170     |     6     |     20      |
| Predicted Negroid   |     18      |    202    |     10      |
| Predicted Mongoloid |     19      |     3     |     166     |

Precision: 0.876
Recall: 0.875
F1-Score: 0.875

Model accuracy: 87.622%

