
CNN MODEL 4
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 94, 94, 16)        448       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 92, 92, 32)        4640      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 46, 46, 32)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 46, 46, 32)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 67712)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               17334528  
_________________________________________________________________
batch_normalization_1 (Batch (None, 256)               1024      
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0         
_________________________________________________________________
activation_1 (Activation)    (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 3)                 771       
=================================================================
Total params: 17,341,411
Trainable params: 17,340,899
Non-trainable params: 512
_________________________________________________________________

=================================================================
====================== CONFUSION MATRIX =========================

|                     |   Actual    |  Actual   |   Actual    |
|                     |  Caucasoid  |  Negroid  |  Mongoloid  |
|---------------------+-------------+-----------+-------------|
| Predicted Caucasoid |     154     |     4     |     11      |
| Predicted Negroid   |     30      |    204    |     14      |
| Predicted Mongoloid |     23      |     3     |     171     |

Precision: 0.867
Recall: 0.861
F1-Score: 0.859

Model accuracy: 86.156%

