
CNN MODEL 7
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 94, 94, 4)         112       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 92, 92, 8)         296       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 46, 46, 8)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 46, 46, 8)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 44, 44, 16)        1168      
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 42, 42, 32)        4640      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 21, 21, 32)        0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 21, 21, 32)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 14112)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               7225856   
_________________________________________________________________
batch_normalization_1 (Batch (None, 512)               2048      
_________________________________________________________________
dropout_3 (Dropout)          (None, 512)               0         
_________________________________________________________________
activation_1 (Activation)    (None, 512)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 3)                 1539      
=================================================================
Total params: 7,235,659
Trainable params: 7,234,635
Non-trainable params: 1,024
_________________________________________________________________

=================================================================
====================== CONFUSION MATRIX =========================

|                     |   Actual    |  Actual   |   Actual    |
|                     |  Caucasoid  |  Negroid  |  Mongoloid  |
|---------------------+-------------+-----------+-------------|
| Predicted Caucasoid |     179     |     5     |     19      |
| Predicted Negroid   |     12      |    204    |      9      |
| Predicted Mongoloid |     16      |     2     |     168     |

Precision: 0.897
Recall: 0.896
F1-Score: 0.896

Model accuracy: 89.739%

