
CNN MODEL 4
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 90, 90, 8)         1184      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 84, 84, 16)        6288      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 42, 42, 16)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 42, 42, 16)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 36, 36, 32)        25120     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 30, 30, 64)        100416    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 15, 15, 64)        0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 15, 15, 64)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 14400)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               7373312   
_________________________________________________________________
batch_normalization_1 (Batch (None, 512)               2048      
_________________________________________________________________
dropout_3 (Dropout)          (None, 512)               0         
_________________________________________________________________
activation_1 (Activation)    (None, 512)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 3)                 1539      
=================================================================
Total params: 7,509,907
Trainable params: 7,508,883
Non-trainable params: 1,024
_________________________________________________________________

=================================================================
====================== CONFUSION MATRIX =========================

|                     |   Actual    |  Actual   |   Actual    |
|                     |  Caucasoid  |  Negroid  |  Mongoloid  |
|---------------------+-------------+-----------+-------------|
| Predicted Caucasoid |     172     |     6     |     14      |
| Predicted Negroid   |     14      |    202    |      9      |
| Predicted Mongoloid |     21      |     3     |     173     |

Precision: 0.891
Recall: 0.890
F1-Score: 0.890

Model accuracy: 89.088%

