
CNN MODEL 6
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 94, 94, 8)         224       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 92, 92, 16)        1168      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 46, 46, 16)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 46, 46, 16)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 44, 44, 32)        4640      
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 42, 42, 64)        18496     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 21, 21, 64)        0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 21, 21, 64)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 19, 19, 32)        18464     
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 17, 17, 64)        18496     
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 8, 8, 64)          0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 8, 8, 64)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 4096)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               2097664   
_________________________________________________________________
batch_normalization_1 (Batch (None, 512)               2048      
_________________________________________________________________
dropout_4 (Dropout)          (None, 512)               0         
_________________________________________________________________
activation_1 (Activation)    (None, 512)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 3)                 1539      
=================================================================
Total params: 2,162,739
Trainable params: 2,161,715
Non-trainable params: 1,024
_________________________________________________________________

=================================================================
====================== CONFUSION MATRIX =========================

|                     |   Actual    |  Actual   |   Actual    |
|                     |  Caucasoid  |  Negroid  |  Mongoloid  |
|---------------------+-------------+-----------+-------------|
| Predicted Caucasoid |     167     |     2     |     16      |
| Predicted Negroid   |     22      |    206    |      9      |
| Predicted Mongoloid |     18      |     3     |     171     |

Precision: 0.888
Recall: 0.885
F1-Score: 0.884

Model accuracy: 88.599%

