
CNN MODEL 1
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 94, 94, 8)         224       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 92, 92, 16)        1168      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 46, 46, 16)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 46, 46, 16)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 44, 44, 32)        4640      
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 42, 42, 64)        18496     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 21, 21, 64)        0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 21, 21, 64)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 28224)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               14451200  
_________________________________________________________________
batch_normalization_1 (Batch (None, 512)               2048      
_________________________________________________________________
dropout_3 (Dropout)          (None, 512)               0         
_________________________________________________________________
activation_1 (Activation)    (None, 512)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 3)                 1539      
=================================================================
Total params: 14,479,315
Trainable params: 14,478,291
Non-trainable params: 1,024
_________________________________________________________________

=================================================================
====================== CONFUSION MATRIX =========================

|                     |   Actual    |  Actual   |   Actual    |
|                     |  Caucasoid  |  Negroid  |  Mongoloid  |
|---------------------+-------------+-----------+-------------|
| Predicted Caucasoid |     179     |     2     |     17      |
| Predicted Negroid   |     16      |    208    |     13      |
| Predicted Mongoloid |     12      |     1     |     166     |

Precision: 0.903
Recall: 0.899
F1-Score: 0.899

Model accuracy: 90.065%

