
CNN MODEL 3
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 92, 92, 8)         608       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 88, 88, 16)        3216      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 44, 44, 16)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 44, 44, 16)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 40, 40, 32)        12832     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 36, 36, 64)        51264     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 18, 18, 64)        0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 18, 18, 64)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 20736)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               10617344  
_________________________________________________________________
batch_normalization_1 (Batch (None, 512)               2048      
_________________________________________________________________
dropout_3 (Dropout)          (None, 512)               0         
_________________________________________________________________
activation_1 (Activation)    (None, 512)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 3)                 1539      
=================================================================
Total params: 10,688,851
Trainable params: 10,687,827
Non-trainable params: 1,024
_________________________________________________________________

=================================================================
====================== CONFUSION MATRIX =========================

|                     |   Actual    |  Actual   |   Actual    |
|                     |  Caucasoid  |  Negroid  |  Mongoloid  |
|---------------------+-------------+-----------+-------------|
| Predicted Caucasoid |     168     |     3     |     17      |
| Predicted Negroid   |     27      |    207    |     11      |
| Predicted Mongoloid |     12      |     1     |     168     |

Precision: 0.889
Recall: 0.883
F1-Score: 0.883

Model accuracy: 88.436%

